&НаКлиенте
Процедура ЗапуститьМедленныйОтчет(Команда)
    
    Если Период.ДатаНачала = Неопределено ИЛИ Период.ДатаОкончания = Неопределено Тогда
        Сообщить("Укажите период!");
        Возврат;
    КонецЕсли;
    
    Результат = ЗапуститьМедленныйОтчетНаСервере(Период.ДатаНачала, Период.ДатаОкончания);
        
    Сообщить("Медленный отчет выполнен за: " + Результат.ВремяВыполнения + " мс. Строк: " + Результат.КоличествоСтрок);
    
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьМедленныйОтчетНаСервере(НачалоПериода, КонецПериода)
    
    Результат = Новый Структура;
    
    НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
    
    ТаблицаРезультата = ЗамерНачалаОткрытия.МедленныйОтчет(НачалоПериода, КонецПериода);
    
    КонецЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
    
    Результат.Вставить("ВремяВыполнения", КонецЗамера - НачалоЗамера);
    Результат.Вставить("КоличествоСтрок", ТаблицаРезультата.Количество());
    
    Возврат Результат;
    
КонецФункции

&НаКлиенте
Процедура ЗапуститьБыстрыйОтчет(Команда)
    
    Если Период.ДатаНачала = Неопределено ИЛИ Период.ДатаОкончания = Неопределено Тогда
        Сообщить("Укажите период!");
        Возврат;
    КонецЕсли;

	Результат = ЗапуститьБыстрыйОтчетНаСервере(Период.ДатаНачала, Период.ДатаОкончания);
        
    Сообщить("Быстрый отчет выполнен за: " + Результат.ВремяВыполнения + " мс. Строк: " + Результат.КоличествоСтрок);
        
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗапуститьБыстрыйОтчетНаСервере(НачалоПериода, КонецПериода)
    
    Результат = Новый Структура;
    
    НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
    
    ТаблицаРезультата = ЗамерНачалаОткрытия.БыстрыйОтчет(НачалоПериода, КонецПериода);
    
    КонецЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
    
    Результат.Вставить("ВремяВыполнения", КонецЗамера - НачалоЗамера);
    Результат.Вставить("КоличествоСтрок", ТаблицаРезультата.Количество());
    
    Возврат Результат;
    
КонецФункции
